[
  {
    "id": 1,
    "title": "SiteSimulation",
    "marketingline": "Experience Your Site's Performance Across Different Network Speeds",
    "description": "Simulate your website’s load time across 5G, 4G, 3G, and 2G speeds to enhance user experience.",
    "largedescription": "SiteSimulation is designed to help developers and website owners understand the performance of their sites across various network speeds. By simulating load times on 5G, 4G, 3G, and 2G, SiteSimulation enables users to experience their site as users on slower networks would, providing insights into necessary optimizations for better accessibility and user experience.",
    "image": "/images/Featured-image-AI-image-generators-by-Midjourney.webp",
    "heading2": "Network Speed Simulation for Improved Performance Insights",
    "description2": "Gain a realistic view of how your website performs under different network conditions.",
    "download": "",
    "filetype": "Web Application",
    "livelink": "https://sitesimulation-unkit.vercel.app/",
    "github": "https://github.com/Anktw/sitesimulation",
    "whyuse1": "Test Across Multiple Network Speeds",
    "whyuse2": "Identify Performance Bottlenecks",
    "whyuse3": "Improve User Experience on Slower Networks",
    "whyuse4": "Optimize Loading Times for Mobile Devices",
    "whyuse5": "Gain Real-World Insights into Site Speed",
    "whyuse6": "Instant URL Testing",
    "desc1": "Experience your site's performance on 5G, 4G, 3G, and 2G to optimize for all users.",
    "desc2": "Easily pinpoint and address loading bottlenecks affecting lower network speeds.",
    "desc3": "Enhance accessibility and user satisfaction by improving load times on slower connections.",
    "desc4": "Understand and optimize for mobile users who may not have high-speed connections.",
    "desc5": "Access a clear view of speed performance metrics for effective improvements.",
    "desc6": "Test any site URL instantly for fast, actionable insights.",
    "working": "SiteSimulation allows users to input a website URL and select a network speed for simulation (5G, 4G, 3G, or 2G). It then emulates the load time and displays performance metrics, loading indicators, and possible bottlenecks in real-time. Developers can see the visual representation of loading and pinpoint areas for optimization to enhance user experience across all network conditions.",
    "techStack": ["Next", "Tailwind", "React"]
  },
  {
    "id": 2,
    "title": "DeepTrace",
    "marketingline": "A cutting-edge AI solution for detecting AI-generated content across multiple formats.",
    "description": "AI-Powered Detection for Texts, Images, Videos, and PDFs",
    "largedescription": "DeepTrace leverages advanced machine learning models to analyze and detect AI-generated content, including text, images, videos, and PDFs. It provides high-accuracy analysis, ensuring authenticity and transparency in digital content.",
    "image": "/images/deeptrace.jpg",
    "heading2": "Next-Level AI Content Verification",
    "description2": "DeepTrace scans digital content with powerful AI algorithms to identify synthetic media, offering detailed insights and authenticity scores.",
    "livelink": "https://deeptrace-unkit.vercel.app/",
    "github": "https://github.com/Anktw/deeptrace",
    "whyuse1": "Detects AI-Generated Text with High Accuracy",
    "whyuse2": "Identifies Deepfake Images and Videos",
    "whyuse3": "Scans and Analyzes PDFs for AI-Generated Content",
    "whyuse4": "Provides Real-Time Content Verification",
    "whyuse5": "Enhances Digital Security and Trust",
    "whyuse6": "Supports Multiple Content Formats",
    "desc1": "DeepTrace analyzes text for linguistic patterns, probability scores, and inconsistencies to detect AI-generated content.",
    "desc2": "Using deep neural networks, it can identify manipulated or AI-generated images and videos.",
    "desc3": "Scans entire PDFs to detect AI-written sections and synthetically altered media.",
    "desc4": "Real-time detection ensures that content is verified before being published or shared.",
    "desc5": "Protects against misinformation by identifying synthetic and AI-generated data.",
    "desc6": "Compatible with a variety of digital content formats, ensuring comprehensive analysis.",
    "working": "DeepTrace integrates NLP models like GPTZero for text detection, computer vision techniques for AI-generated image and video analysis, and PDF parsing for document authenticity checks. It processes content server-side to maintain security and efficiency.",
    "techStack": ["Next", "FastAPI", "MongoDB", "Tailwind"]
  },
  {
    "id": 12,
    "title": "SSRSearch",
    "marketingline": "A High-Performance Server-Side Search Engine",
    "description": "An advanced search platform powered entirely by server-side rendering for optimal speed, security, and SEO.",
    "largedescription": "SSRSearch is a fully server-rendered search engine designed for high performance, scalability, and seamless user experience. By processing queries and rendering results on the server, it ensures instant response times, reduces client-side overhead, and enhances SEO visibility. Built with Next.js, it leverages server components to deliver a streamlined, real-time search experience without unnecessary frontend complexity.",
    "image": "/images/SSRSearch Logo.png",
    "heading2": "Optimized Search with Server-Side Efficiency",
    "description2": "SSRSearch processes and delivers search results directly from the server, reducing frontend dependency while improving speed, accuracy, and scalability.",
    "livelink": "https://ssrsearch-unkit.vercel.app/",
    "github": "https://github.com/Anktw/ssrsearch",
    "whyuse1": "Superior SEO Performance",
    "whyuse2": "Lightning-Fast Search Queries",
    "whyuse3": "Minimal Frontend Load",
    "whyuse4": "Dynamic, Real-Time Indexing",
    "whyuse5": "Robust Security with Server-Only Processing",
    "whyuse6": "Scalable and Adaptable Architecture",
    "desc1": "With fully server-rendered pages, SSRSearch ensures that search engines efficiently crawl and index content, leading to higher visibility.",
    "desc2": "Search queries are processed on the backend, eliminating delays and delivering instant, accurate results.",
    "desc3": "By keeping computations and rendering on the server, client-side overhead is drastically minimized, ensuring a smooth browsing experience.",
    "desc4": "New data is dynamically indexed in real time, providing users with the most up-to-date search results without page reloads.",
    "desc5": "Critical search logic and processing remain on the server, eliminating security risks associated with client-side execution.",
    "desc6": "Designed for scalability, SSRSearch can efficiently handle increasing query loads without performance bottlenecks.",
    "working": "SSRSearch leverages Next.js's advanced server components to handle all search processing, data retrieval, and rendering on the backend. Each query triggers a server-side request, delivering results instantly without relying on client-side execution. This approach ensures superior performance, improved SEO rankings, and a seamless user experience across different devices. Whether used for knowledge bases, research archives, or open-source repositories, SSRSearch adapts dynamically to various use cases.",
    "techStack": ["Next", "MySQL", "Tailwind", "Redis"]
  },
  {
    "id": 13,
    "title": "CampusConnect",
    "marketingline": "Connect, Compete, and Stay Informed",
    "description": "Campus community in a social platform",
    "largedescription": "CampusConnect is designed exclusively for students to enhance their campus experience. It brings together features like leaderboards for friendly competition, event management to stay updated on campus activities, and a comprehensive hub for all college related information.",
    "image": "/images/campusconnect logo.png",
    "heading2": "Social Media like User Interface and Functionalities",
    "description2": "CampusConnect incorporates a user interface and features that closely resemble popular social media platforms, fostering seamless interaction and engagement among students.",
    "livelink": "https://campusconnect-unkit.vercel.app/",
    "github": "https://github.com/Anktw/campusconnect",
    "whyuse1": "Centralized Hub for Campus Activities",
    "whyuse2": "Competitive Leaderboards",
    "whyuse3": "Seamless Social Media Experience",
    "whyuse4": "Skill Recognition",
    "whyuse5": "Event Management and Participation",
    "whyuse6": "Accessible Anytime, Anywhere",
    "desc1": "CampusConnect simplifies access to college events, resources, and discussions in one platform.",
    "desc2": "Students can showcase skills in sports, coding, and more, ranked in real-time leaderboards.",
    "desc3": "It provides a social platform for sharing posts, engaging with peers, and staying updated.",
    "desc4": "CampusConnect highlights student achievements, motivating them to participate actively in campus life.",
    "desc5": "The app enables easy creation, joining, and tracking of campus events.",
    "desc6": "With mobile-first design, students can access all features and resources on-the-go.",
    "working": "The CampusConnect Leaderboard collects data from various aspects of a student's college journey—such as academic scores, participation in extracurricular activities, and contributions to sustainability or community service. Each category is assigned a weightage, and students accumulate points based on their performance. The system updates the rankings in real-time, allowing students to see their position and progress compared to their peers. It motivates students to enhance their skills across multiple domains, with top performers being highlighted for recognition.",
    "techStack": ["Javascript", "React", "Tailwind", "Next", "MongoDB"]
  },
  {
    "id": 14,
    "title": "EthicsBook",
    "marketingline": "A platform where users control their feed",
    "description": "Fair, Transparent, and User-Controlled",
    "largedescription": "EthicsBook is a social media platform designed to bring fairness and transparency to content discovery. Unlike mainstream networks that manipulate engagement through hidden AI-driven algorithms, EthicsBook ensures that users have full control over their feed. It eliminates biased recommendations and prioritizes user choice in content ranking.",
    "image": "/images/Featured-image-AI-image-generators-by-Midjourney.webp",
    "heading2": "Fair, Transparent, and User-Controlled",
    "description2": "EthicsBook removes hidden algorithmic biases, giving users more control over what they see while protecting privacy and ensuring fairness.",
    "download": "",
    "filetype": "Apk",
    "livelink": "https://ethicsbook-unkit.vercel.app/",
    "github": "https://github.com/Anktw/ethicsbook",
    "whyuse1": "No Hidden Content Manipulation",
    "whyuse2": "User-Controlled Algorithmic Feeds",
    "whyuse3": "Privacy-Focused Social Experience",
    "whyuse4": "Freedom from Censorship",
    "whyuse5": "Transparent, Open-Source Ranking System",
    "desc1": "Unlike mainstream platforms, EthicsBook doesn’t manipulate feeds for engagement—it puts you in charge.",
    "desc2": "You decide how content is ranked, ensuring a fair and unbiased experience.",
    "desc3": "Privacy is a priority—your data remains yours, free from corporate exploitation.",
    "desc4": "Censorship-resistant design ensures free expression without external control.",
    "desc5": "All ranking and engagement algorithms are open-source, ensuring full transparency.",
    "working": "EthicsBook uses FastAPI and PostgreSQL to provide a fast and efficient social media experience. Instead of AI-driven manipulation, it offers user-configurable ranking options and a transparent algorithm. Built with Flutter, it ensures a smooth mobile experience while keeping user data secure.",
    "techStack": ["Flutter", "FastAPI", "PostgreSQL"]
  }
]
